modules/controllers/OrderController.php

    public function actionList()//订单列表
    {
        $this->layout = "layout1";
        $model = Order::find();
        $count = $model->count();
        $pageSize = Yii::$app->params['pageSize']['order'];
        $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $data = $model->offset($pager->offset)->limit($pager->limit)->all();
---
SELECT COUNT(*) FROM `shop_order`
SELECT * FROM `shop_order` LIMIT 10

    public function actionDetail()//订单列表中的查看按钮
    {
        $this->layout = "layout1";
        $orderid = (int)Yii::$app->request->get('orderid');
        $order = Order::find()->where('orderid = :oid', [':oid' => $orderid])->one();
---
SELECT * FROM `shop_order` WHERE orderid = 25

    public function actionSend()//商品发货处理
    {
        $this->layout = "layout1";
        $orderid = (int)Yii::$app->request->get('orderid');
        $model = Order::find()->where('orderid = :oid', [':oid' => $orderid])->one();
---
SELECT * FROM `shop_order` WHERE orderid = 27