models/Category.php

    public static function getMenu()
    {
        $top = self::find()->where('parentid = :pid', [":pid" => 0])->limit(11)->orderby('createtime asc')->asArray()->all();//查询出顶级分类
        $data = [];
        foreach((array)$top as $k=>$cate) {  //根据顶级分类查询出二级分类
            $cate['children'] = self::find()->where("parentid = :pid", [":pid" => $cate['cateid']])->limit(10)->asArray()->all();
---
SELECT * FROM `shop_category` WHERE parentid = 0 ORDER BY `createtime` LIMIT 11
SELECT * FROM `shop_category` WHERE parentid = '1' LIMIT 10